import { NewRecipe } from "../../models/recipe";

export const apelsinovyjPirogSRikottojPoItalyanski: NewRecipe = {
  title: "Апельсиновый пирог с рикоттой по-итальянски",
  description:
    "Этот апельсиновый пирог с рикоттой в итальянском стиле получается воздушным, мягким и наполненным интенсивным апельсиновым вкусом благодаря цедре и свежим апельсиновым долькам! Липкая карамельная начинка придает торту цитрусовой сладости, в то время как мягкий фруктовый вкус оливкового масла идеально уравновешивает вкус торта. ",
  image: {
    src: "/content/recipes/apelsinovyj-pirog-s-rikottoj-po-italyanski/main.jpg",
  },
  foodTypes: ["Выпечка"],
  kitchens: ["Средиземноморская"],
  diets: [],
  durations: {
    preparation: 20,
    cooking: 40,
  },
  calories: 272,
  servings: 12,
  tools: ["Форма для выпечки", "Миска", "Духовой шкаф"],
  ingredients: [
    {
      name: "сливочное масло",
      note: "",
      amount: {
        value: 25.0,
        unit: "г",
      },
    },
    {
      name: "коричневый сахар",
      note: "",
      amount: {
        value: 0.5,
        unit: "стакан",
      },
    },
    {
      name: "вода",
      note: "",
      amount: {
        value: 1.0,
        unit: "ст. л.",
      },
    },
    {
      name: "апельсин",
      note: "",
      amount: {
        value: 2.0,
        unit: "шт",
      },
    },
    {
      name: "рикотта",
      note: "частично обезжиренной",
      amount: {
        value: 1.5,
        unit: "стакан",
      },
    },
    {
      name: "оливковое масло первого отжима",
      note: "",
      amount: {
        value: 0.5,
        unit: "стакан",
      },
    },
    {
      name: "ванильный экстракт",
      note: "",
      amount: {
        value: 0.5,
        unit: "ч. л.",
      },
    },
    {
      name: "яйца",
      note: "",
      amount: {
        value: 3.0,
        unit: "шт",
      },
    },
    {
      name: "универсальная мука",
      note: "",
      amount: {
        value: 1.5,
        unit: "стакан",
      },
    },
    {
      name: "разрыхлитель",
      note: "",
      amount: {
        value: 2.0,
        unit: "ч. л.",
      },
    },
    {
      name: "соль",
      note: "",
      amount: {
        value: 0.75,
        unit: "ч. л.",
      },
    },
    {
      name: "сахарный песок",
      note: "",
      amount: {
        value: 0.75,
        unit: "стакан",
      },
    },
    {
      name: "сахарная пудра",
      note: "",
      amount: {
        value: 10.0,
        unit: "г",
      },
    },
  ],
  stepGroups: [
    {
      name: "",
      steps: [
        {
          body: "Разогрейте духовку до 180 градусов. Смажьте форму для выпекания очень хорошо (щедро снизу и с обеих сторон). Выстелите дно кружочком пергаментной бумаги.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Смешайте коричневый сахар и воду, чтобы получилась густая пастообразная кашица, затем очень тонко и равномерно распределите ее по дну сковороды (я использовала тыльную сторону ложки и продолжала разравнивать кашицу, пока она не стала однородной и однородной).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Выложите дольки апельсина поверх коричневой сахарной глазури на дно формы для выпекания.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "В большой миске взбейте рикотту, оливковое масло и ваниль. Добавляйте по одному яйцу за раз и взбивайте до однородности.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Просейте муку, разрыхлитель и соль непосредственно поверх сочных ингредиентов. Взбейте или перемешайте ложкой. Смешайте сахар с цедрой двух апельсинов и добавьте ее в смесь. Снова перемешайте, пока тесто не станет хорошо однородным (оно может выглядеть немного густым и зернистым. Это прекрасно, но убедитесь, что это хорошо сочетается)",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Выложите тесто в подготовленную форму для кекса. Слегка встряхните, чтобы равномерно распределить.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Выпекайте в разогретой духовке 45 минут или больше, пока зубочистка, вставленная в середину пирога, не выйдет чистой (вы должны начать проверять примерно через 40 минут, но на это может уйти 1 час. Вы хотите убедиться, что дно имеет приятный глубокий карамельный цвет, но не пригорает)",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Охладите на сковороде в течение 5 минут или около того. Проведите тонким ножом по углам, чтобы разрыхлить пирог, затем аккуратно переверните на сервировочную тарелку. (Некоторые дольки апельсина на дне могут застрять в форме, аккуратно вытащите их и при необходимости выложите на пирог. Но именно поэтому так важна хорошо смазанная маслом сковорода).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Дайте полностью остыть, затем нарежьте ломтиками. Подавайте с вашим любимым мороженым. Наслаждайтесь!",
          ingredientIndexes: [],
          image: null,
        },
      ],
    },
  ],
  notes: [],
};
