import { NewRecipe } from "../../models/recipe";

export const legkayaDomashnyayaKurinayaShaurmaSSousomTahini: NewRecipe = {
  title: "Легкая домашняя куриная шаурма",
  description:
    "Легкая домашняя куриная шаурма — одно из моих самых любимых ближневосточных уличных блюд. ",
  image: {
    src: "/content/recipes/legkaya-domashnyaya-kurinaya-shaurma-s-sousom-tahini/kurinaya_shaurma_1.jpg",
  },
  foodTypes: ["Уличная еда"],
  kitchens: ["Арабская"],
  diets: [],
  durations: {
    preparation: 10,
    cooking: 30,
  },
  calories: 153,
  servings: 5,
  tools: ["Миска для смешивания", "Противень"],
  ingredients: [
    {
      name: "лепешки",
      note: "для шаурмы",
      amount: {
        value: 6.0,
        unit: "шт",
      },
    },
    {
      name: "молотый тмин",
      note: "",
      amount: {
        value: 0.75,
        unit: "ст. л.",
      },
    },
    {
      name: "куркума",
      note: "в порошке",
      amount: {
        value: 0.75,
        unit: "ст. л.",
      },
    },
    {
      name: "кориандр",
      note: "молотого",
      amount: {
        value: 0.75,
        unit: "ст. л.",
      },
    },
    {
      name: "чесночный порошок",
      note: "",
      amount: {
        value: 0.75,
        unit: "ст. л.",
      },
    },
    {
      name: "паприка",
      note: "",
      amount: {
        value: 0.75,
        unit: "ст. л.",
      },
    },
    {
      name: "молотая гвоздика",
      note: "",
      amount: {
        value: 0.5,
        unit: "ч. л.",
      },
    },
    {
      name: "кайенский перец",
      note: "",
      amount: {
        value: 0.5,
        unit: "ч. л.",
      },
    },
    {
      name: "соль",
      note: "",
      amount: {
        value: 0.25,
        unit: "ч. л.",
      },
    },
    {
      name: "куриное бедро",
      note: "без кожи и костей",
      amount: {
        value: 8.0,
        unit: "шт",
      },
    },
    {
      name: "луковица",
      note: "тонко нарезанная",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "лимон",
      note: "сок необходим",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "оливковое масло",
      note: "extra virgin",
      amount: {
        value: 0.3333333333333333,
        unit: "стакан",
      },
    },
    {
      name: "рукколы",
      note: "",
      amount: {
        value: 60.0,
        unit: "г",
      },
    },
    {
      name: "помидоры",
      note: "нарезанных",
      amount: {
        value: 6.0,
        unit: "шт",
      },
    },
    {
      name: "огурец",
      note: "нарезанных",
      amount: {
        value: 4.0,
        unit: "шт",
      },
    },
    {
      name: "оливки",
      note: "без косточек (по желанию)",
      amount: {
        value: 20.0,
        unit: "г",
      },
    },
    {
      name: "соус тахини",
      note: "",
      amount: {
        value: 200.0,
        unit: "мл",
      },
    },
  ],
  stepGroups: [
    {
      name: "",
      steps: [
        {
          body: "В небольшой миске смешайте тмин, куркуму, кориандр, чесночный порошок, сладкую паприку. Отложите пока смесь специй для шаурмы.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Обсушите куриные бедра и посолите с обеих сторон, затем нарежьте тонкими ломтиками.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Поместите курицу в большую миску. Добавьте специи для шаурмы и перемешайте. Добавьте лук, лимонный сок и оливковое масло. Снова все перемешайте. Накройте и поставьте в холодильник на 3 часа или на ночь (если у вас нет времени, вы можете сократить или пропустить время маринования). Противень перед выкладкой мясных кусочков слегка смажьте маслом.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Когда будете готовы, выложите куриную шаурму на большой противень и запекайте в разогретой до 220 градусов духовке около 30 минут (вы можете проверить немного раньше, так как духовки бывают разные).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Настоящий ближневосточный способ подачи куриной шаурмы —это карманы из лаваша или листовой лаваш с множеством овощей и большим количеством соуса. Мне нравится идея загруженных карманов лаваша. А из овощей — попробуйте рукколу с перцем, помидорами и огурцами.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Вы можете подавать куриную шаурму, щедро снабдив ее соусом тахини. В ближневосточном варианте шаурмы часто используют соус на основе белого йогурта, такой как греческий цацики.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Нагрейте в печи немного карманы лавашной лепешки, смажьте ее соусом и добавляйте куриную шаурму, рукколу и помидоры с огурцами, оливки. Сразу подавайте!",
          ingredientIndexes: [],
          image: null,
        },
      ],
    },
  ],
  notes: [],
};
