import { NewRecipe } from "../../models/recipe";

export const luchshijReczeptKotletDlyaGamburgera: NewRecipe = {
  title: "Лучший рецепт котлет для гамбургера",
  description:
    "Лучший рецепт котлет для гамбургеров - толстые или тонкие, приготовленные на гриле или на плите - это лучший и самый простой универсальный рецепт идеальных котлет для гамбургеров!",
  image: {
    src: "/content/recipes/luchshij-reczept-kotlet-dlya-gamburgera/hamburger_5.jpg",
  },
  foodTypes: ["Заготовки", "Уличная еда"],
  kitchens: ["Американская"],
  diets: [],
  durations: {
    preparation: 15,
    cooking: 8,
  },
  calories: 434,
  servings: 6,
  tools: ["Столовая ложка", "Чугунная сковорода", "Миска"],
  ingredients: [
    {
      name: "фарш",
      note: "",
      amount: {
        value: 900.0,
        unit: "г",
      },
    },
    {
      name: "измельченные крекеры",
      note: "или панировочных сухарей Панко",
      amount: {
        value: 35.0,
        unit: "г",
      },
    },
    {
      name: "вустерширский соус",
      note: "",
      amount: {
        value: 30.0,
        unit: "мл",
      },
    },
    {
      name: "молоко",
      note: "",
      amount: {
        value: 30.0,
        unit: "мл",
      },
    },
    {
      name: "яйцо",
      note: "",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "чесночный порошок",
      note: "",
      amount: {
        value: 5.0,
        unit: "г",
      },
    },
    {
      name: "луковый порошок",
      note: "",
      amount: {
        value: 5.0,
        unit: "г",
      },
    },
    {
      name: "черный перец",
      note: "",
      amount: {
        value: 2.5,
        unit: "г",
      },
    },
    {
      name: "соль",
      note: "",
      amount: {
        value: 5.0,
        unit: "г",
      },
    },
  ],
  stepGroups: [
    {
      name: "",
      steps: [
        {
          body: "Поставьте большую миску для смешивания. Добавьте в нее говяжий фарш, измельченные крекеры, яйцо, вустерширский соус, молоко, соль, чесночный порошок, луковый порошок и перец.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Перемешивайте вручную, пока мясная смесь не станет гладкой, но остановитесь, как только смесь станет однородной. (Чрезмерное перемешивание может создать плотную тяжелую текстуру).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Вдавите мясо в миску, чтобы получился ровный диск. С помощью ножа разрежьте и разделите гамбургерные котлеты на 6 средних размеров котлет для гриля или сковороды или 12 тонких котлет для гриля.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Выстелите лист для выпечки вощеной бумагой или фольгой, на котором будут лежать котлеты. По одному набирайте смесь для котлет и плотно утрамбовывайте ее в лепешки. Формируйте их чуть больше, чем булочки, которые вы планируете использовать, чтобы учесть усадку во время приготовления. Положите котлеты на лист для выпечки. С помощью ложки сделайте углубление в центре каждой лепешки, чтобы они не вздувались во время приготовления. Если вам нужно сложить пирожки в стопку, разделите их листом вощеной бумаги.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Разогрейте гриль или сковороду на среднем огне, примерно 200 градусов С°.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Для тонких котлет: Готовьте на сковороде по 2 минуты с каждой стороны.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Для толстых котлет: Обжарьте котлеты на гриле или на сковороде по 3-4 минуты с каждой стороны.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Уложите горячие котлеты на булочки для гамбургеров и сверху посыпьте любимыми начинками для гамбургеров. Подавайте теплыми.",
          ingredientIndexes: [],
          image: null,
        },
      ],
    },
  ],
  notes: [],
};
