import { NewRecipe } from "../../models/recipe";

export const minestroneSamyjPopulyarnyjItalyanskijSup: NewRecipe = {
  title: "Минестроне - самый популярный итальянский суп",
  description:
    "Минестроне - легкий итальянский суп. У итальянских хозяек а минестроне зачастую шли продукты из тех, что есть на кухне в данный момент.",
  image: {
    src: "https://eda.cooking/wp-content/uploads/2021/10/sup-minestrone.jpg",
  },
  foodTypes: ["Суп"],
  kitchens: ["Итальянская"],
  diets: [],
  durations: {
    preparation: 40,
    cooking: 20,
  },
  calories: 957,
  servings: 4,
  tools: ["Сковорода", "Кастрюля", "Шумовка"],
  ingredients: [
    {
      name: "картошка",
      note: "",
      amount: {
        value: 200.0,
        unit: "г",
      },
    },
    {
      name: "кабачки",
      note: "",
      amount: {
        value: 100.0,
        unit: "г",
      },
    },
    {
      name: "морковь",
      note: "",
      amount: {
        value: 80.0,
        unit: "г",
      },
    },
    {
      name: "лук",
      note: "",
      amount: {
        value: 50.0,
        unit: "г",
      },
    },
    {
      name: "помидоры",
      note: "",
      amount: {
        value: 100.0,
        unit: "г",
      },
    },
    {
      name: "макароны",
      note: "",
      amount: {
        value: 0.25,
        unit: "стакан",
      },
    },
    {
      name: "сельдерей",
      note: "стебель",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "болгарский перец",
      note: "",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "оливковое масло",
      note: "",
      amount: {
        value: 3.0,
        unit: "ст. л.",
      },
    },
    {
      name: "бульон",
      note: "овощного",
      amount: {
        value: 1.0,
        unit: "л",
      },
    },
    {
      name: "пармезан",
      note: "",
      amount: {
        value: 50.0,
        unit: "г",
      },
    },
    {
      name: "соль",
      note: "",
      amount: {
        value: 1.0,
        unit: "щепотка",
      },
    },
  ],
  stepGroups: [
    {
      name: "",
      steps: [
        {
          body: "Подготовить все необходимые компоненты для приготовления минестроне. Почистить овощи, у перца удалить плодоножку и семена.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Все овощи нарезать маленькими кубиками. Для удобства можно использовать овощерезку. С помидора по желанию можно предварительно снять кожуру.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "В кастрюле разогреть оливковое масло и отправить лук, морковь и сельдерей обжариваться на огне. Не забывайте перемешивать овощи, чтоб они не пригорели. Готовить до момента, когда лук и морковь приобретут слегка золотистый оттенок.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Отправить картошку и болгарский перец в кастрюлю, снова всё перемешать. Огонь слегка убавить и тушить овощи около пяти минут, периодически перемешивая их.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Залить содержимое кастрюли бульоном. Сделать огонь на максимум, посолить по вкусу. После закипания огонь убавить до среднего и варить суп до полугототовности картошки и остальных овощей (около пяти-семи минут).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Добавить кабачки и помидоры ко всем ингредиентам, варить ещё две-три минуты",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Отправить в суп макароны, всё перемешать и оставить кастрюлю на плите на 5 минут.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Добавить в суп мелконарезанную зелень, попробовать снова на соль, если потребуется, то досолить. Накрыть кастрюлю крышкой, снять с огня и дать настояться 15-20 минут (за это время макароны дойдут до готовности, а суп напитается ароматами всех овощей.) Перед подачей кинуть щепотку тертого пармезана в каждую тарелку",
          ingredientIndexes: [],
          image: null,
        },
      ],
    },
  ],
  notes: [],
};
