import { NewRecipe } from "../../models/recipe";

export const myasoSLapshojIOvoshhamiVKazaneNaKostre: NewRecipe = {
  title: "Мясо с лапшой и овощами в казане на костре",
  description: "Мясо с лапшой и овощами, приготовленное в казане на костре.",
  image: {
    src: "https://eda.cooking/wp-content/uploads/2021/10/meat-with-noodles-and-vegetables2.jpg",
  },
  foodTypes: ["Уличная еда"],
  kitchens: ["Монгольская"],
  diets: [],
  durations: {
    preparation: 20,
    cooking: 12,
  },
  calories: 431,
  servings: 4,
  tools: ["Казан", "Нож", "Разделочная доска", "Столовая ложка", "Дрова"],
  ingredients: [
    {
      name: "свинина",
      note: "не жирная",
      amount: {
        value: 350.0,
        unit: "г",
      },
    },
    {
      name: "морковь",
      note: "",
      amount: {
        value: 2.0,
        unit: "шт",
      },
    },
    {
      name: "чеснок",
      note: "",
      amount: {
        value: 4.0,
        unit: "зубчик",
      },
    },
    {
      name: "головка лука",
      note: "",
      amount: {
        value: 6.0,
        unit: "шт",
      },
    },
    {
      name: "сладкий болгарский перец",
      note: "",
      amount: {
        value: 2.0,
        unit: "шт",
      },
    },
    {
      name: "острый перец",
      note: "",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "орех кешью",
      note: "",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "растительное масло",
      note: "",
      amount: {
        value: 60.0,
        unit: "мл",
      },
    },
    {
      name: "кунжутное масло",
      note: "",
      amount: {
        value: 20.0,
        unit: "мл",
      },
    },
    {
      name: "сахарный песок",
      note: "",
      amount: {
        value: 1.0,
        unit: "ст. л.",
      },
    },
    {
      name: "имбирь",
      note: "",
      amount: {
        value: 20.0,
        unit: "г",
      },
    },
    {
      name: "соевый соус",
      note: "",
      amount: {
        value: 30.0,
        unit: "г",
      },
    },
    {
      name: "лапша",
      note: "удон или иная",
      amount: {
        value: 0,
        unit: "",
      },
    },
    {
      name: "зелень",
      note: "по вкусу",
      amount: {
        value: 0,
        unit: "",
      },
    },
    {
      name: "соль",
      note: "",
      amount: {
        value: 0.5,
        unit: "ч. л.",
      },
    },
  ],
  stepGroups: [
    {
      name: "",
      steps: [
        {
          body: "Сначала готовим мясной маринад, смешивая соевый соус, чеснок (3 зубчика) и имбирь. При желании, добавьте немножко кунжутного масла – оно придаст своеобразную нотку вашему шедевру.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Мясо нарезаем очень тонкими полосками, хорошо перемешиваем с приготовленным составом и оставляем томиться, накрыв крышкой.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Пока свинина маринуется, возвращаемся к нарезке промытых овощей. Лук шинкуем колечками, морковь удлинёнными брусками, перец разделываем на узкие кусочки. Оставшийся чеснок, кешью и горький перчик мелко рубим.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Отвариваем макаронные изделия до готовности (не переваривайте!), предварительно посолив по вкусу. Промываем их в дуршлаге под холодной водой. Теперь все компоненты нами подготовлены, пора приступать к основному действию.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Устанавливаем казан над разожжённым костром и основательно прокаливаем его. Наливаем масло. Важное условие – огонь должен быть сильным!",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Первым делом опускаем мясо и жарим его около 4 минут, постоянно перемешивая. Следом идёт морковь, а через 2 минутки присоединяем лук. Продолжая мешать, бросаем болгарский перец.",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Теперь пришла очередь измельчённой смеси кешью, чеснока и острого перца. Подсыпав сахар, выкладываем готовую лапшу. Ещё раз, перемешав продукты, буквально в течение минуты, мы можем смело снимать казан с огня. Посыпаем сверху своё кулинарное творение зеленью и приглашаем домочадцев к столу.",
          ingredientIndexes: [],
          image: null,
        },
      ],
    },
  ],
  notes: [],
};
