import { NewRecipe } from "../../models/recipe";

export const zharenyeKrevetkiIKabachkiPoSredizemnomorski: NewRecipe = {
  title: "Жареные креветки и кабачки по-средиземноморски",
  description:
    "Этот простой средиземноморский рецепт обжаренных креветок и овощей готовится всего за 20 минут! ",
  image: {
    src: "/content/recipes/zharenye-krevetki-i-kabachki-po-sredizemnomorski/krevetki_s_zukini_.jpg",
  },
  foodTypes: ["Морепродукты"],
  kitchens: ["Средиземноморская"],
  diets: [],
  durations: {
    preparation: 10,
    cooking: 15,
  },
  calories: 113,
  servings: 4,
  tools: ["Миска", "Сковорода"],
  ingredients: [
    {
      name: "орегано",
      note: "сухое",
      amount: {
        value: 1.5,
        unit: "ст. л.",
      },
    },
    {
      name: "тмин",
      note: "молотого",
      amount: {
        value: 1.0,
        unit: "ч. л.",
      },
    },
    {
      name: "кориандр",
      note: "молотого",
      amount: {
        value: 1.0,
        unit: "ч. л.",
      },
    },
    {
      name: "сладкая паприка",
      note: "",
      amount: {
        value: 0.5,
        unit: "ч. л.",
      },
    },
    {
      name: "большие креветки",
      note: "очищенных",
      amount: {
        value: 0.45,
        unit: "кг",
      },
    },
    {
      name: "оливковое масло",
      note: "extra virgin",
      amount: {
        value: 2.0,
        unit: "ст. л.",
      },
    },
    {
      name: "красная луковица",
      note: "среднего размера. Тонко порезать",
      amount: {
        value: 0.5,
        unit: "шт",
      },
    },
    {
      name: "чеснок",
      note: "измельчить и разделить",
      amount: {
        value: 5.0,
        unit: "зубчик",
      },
    },
    {
      name: "болгарский перец",
      note: "нарезанный соломкой",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "цукини",
      note: "",
      amount: {
        value: 1.5,
        unit: "шт",
      },
    },
    {
      name: "консервированный нут",
      note: "",
      amount: {
        value: 1.0,
        unit: "стакан",
      },
    },
    {
      name: "помидоры черри",
      note: "разрезанных пополам",
      amount: {
        value: 20.0,
        unit: "шт",
      },
    },
    {
      name: "соль",
      note: "",
      amount: {
        value: 5.0,
        unit: "г",
      },
    },
    {
      name: "черный перец",
      note: "",
      amount: {
        value: 5.0,
        unit: "г",
      },
    },
    {
      name: "лимон",
      note: "сок большого лимона",
      amount: {
        value: 1.0,
        unit: "шт",
      },
    },
    {
      name: "базилик",
      note: "",
      amount: {
        value: 20.0,
        unit: "г",
      },
    },
  ],
  stepGroups: [
    {
      name: "",
      steps: [
        {
          body: "В небольшой миске смешайте специи (орегано, тмин, кориандр и перец).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Посушите креветки и приправьте солью и 1 ½ чайной ложки смеси специй. Отложите ненадолго или поставьте в холодильник на потом. ",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "В большой сковороде на среднем огне разогрейте 2 столовые ложки оливкового масла первого отжима. Добавьте лук и ½ количества чеснока и готовьте от 3 до 4 минуты, регулярно помешивая, пока не появится аромат (не позволяйте чесноку подгореть).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Добавьте кабачки-цуккини, болгарский перец и нут. Приправьте солью, перцем и оставшейся смесью специй. Перемешайте. При необходимости немного увеличьте огонь и готовьте овощи до мягкости, регулярно помешивая (около 5-7 минут).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Переложите овощи на большую тарелку. Верните сковороду на огонь и добавьте немного оливкового масла. Добавьте приправленные креветки и оставшийся чеснок. Готовьте на среднем огне, периодически помешивая, пока креветки не станут полностью розовыми (около 4-5 минут).",
          ingredientIndexes: [],
          image: null,
        },
        {
          body: "Добавьте приготовленные овощи обратно в сковороду с креветками. Добавьте помидоры черри и лимонный сок. Перемешайте. Закончите свежим базиликом.",
          ingredientIndexes: [],
          image: null,
        },
      ],
    },
  ],
  notes: [],
};
